In [1]:
import pandas as pd
import mysql.connector as sql

In [3]:
db_connection=sql.connect(host="localhost", user="root",database='amazonindia')

In [34]:
query='''SELECT * FROM customer '''

In [35]:
data=pd.read_sql(query,db_connection)

In [36]:
data

,CustomerId,Name,Address,Sex,Phone
0,1,Kunal Kamble,304 classic kalapataru sec-16 new panvel,M,2147483647
1,2,Nikil kamble,304 classic kalapataru sec-16 new panvel,M,2147483647
2,3,Nitin Pol,Bhim nager bhind sarvodaya hospital gatkopar-W,M,825693217
3,4,shekar Pol,Bhim nager bhind sarvodaya hospital gatkopar-W,M,992085396
4,5,Niru kamble,304 classic kalapataru sec-16 new panvel,M,2147483647

In [24]:
data.set_index('CustomerId',inplace=True)

In [25]:
data

,Name,Address,Sex,Phone
CustomerId,,,,
1,Kunal Kamble,304 classic kalapataru sec-16 new panvel,M,2147483647
2,Nikil kamble,304 classic kalapataru sec-16 new panvel,M,2147483647
3,Nitin Pol,Bhim nager bhind sarvodaya hospital gatkopar-W,M,825693217
4,shekar Pol,Bhim nager bhind sarvodaya hospital gatkopar-W,M,992085396
5,Niru kamble,304 classic kalapataru sec-16 new panvel,M,2147483647

In [43]:
type(data['Name'][2])

str

In [40]:
data.columns.values[2]

'Address'

In [44]:
data['Name'][3]

'shekar Pol'

In [51]:
data['Name'].

0    False
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [68]:
data

,CustomerId,Name,Address,Sex,Phone
0,1,Kunal Kamble,304 classic kalapataru sec-16 new panvel,M,7208539604
1,2,Nikil kamble,304 classic kalapataru sec-16 new panvel,M,7208539609
2,3,Nitin Pol,Bhim nager bhind sarvodaya hospital gatkopar-W,M,825693217
3,4,shekar Pol,Bhim nager bhind sarvodaya hospital gatkopar-W,M,992085396
4,5,Niru kamble,304 classic kalapataru sec-16 new panvel,M,2147483647